# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, 
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних.
#  Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод 
# — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из
#  управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь 
# непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход 
# собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

# Input: 1 3 2 1 1 6
# Output: 10
n=int(input("Введите количество кустов черники: "))
array=list()
for i in range(n):
    ai=int(input(F"Введите количество ягод на кустe {i+1}: "))
    array.append(ai)
print(array)

array_count=list()
for i in range(len(array)-1):
    array_count.append(array[i-1]+array[i]+array[i+1])
array_count.append(array[-2]+array[-1]+array[0])
print(max(array_count))
