list_1=[]
list_1=list()
list_1=[1,2,3,8]
print(*list_1)   #для того чтоб убрать квадратные скобки ил запятые ставь *

for i in list_1:  #такой цикл поочереди принимает значение i и печатает его по строчно
    print(i)

print(len(list_1)) #печатает количество элементов списка
print((list_1[2])) #печатает  элемент списка

list_2=[4,5,8]
print(list_2)
list_2.append(9) # добавляет в конец элемент списка
print(list_2)

list_3=[]
print(list_3)
for i in range(5):
    list_3.append(i) # добавляет в конец элемент списка с каждой итерацией новый элемент
    print(list_3)

list_4=[0, 1, 2, 3, 4]
for i in range(5):
    list_4.pop()    # удаляет в конце элемент списка с каждой итерацией  элемент 
    #,если в скобках поставить(1), удалит элемент с позиции 1
    print(list_4)


list_5=[1,2,3,4,5,6,7,8,9,10]
print(list_5[0])                             #выводим 1
print(list_5[1])                             #выводим 2
print(list_5[-1])                            #выводим 10
print(list_5[-5])                            #выводим 6
print(list_5[:])                             #выводим [1,2,3,4,5,6,7,8,9,10]
print(list_5[:2])                            #выводим [1,2]
print(list_5[len(list_5)-2:])                #выводим [9,10]
print(list_5[2:9])                           #выводим [3,4,5,6,7,8,9]
print(list_5[6:-18])                         #выводим []
print(list_5[0:len(list_5):6])               #выводим [1,7]
print(list_5[::6])                           #выводим [1,7]

# Создаем кортеж. Кортеж -это не изменяемый список. В нем нельзя удалить или добавить что-то

t=()
print(type(t))
t=(1,)             # если после 1 не поставить "," то будет тип Int
print(type(t))
t=(1)             # если после 1 не поставить "," то будет тип Int
print(type(t))
print('_______________________________')

t=(1,5,8,)
print(type(t))
print('_______________________________')

v=[8,7,9]
print(v)
print(type(v))    # список
print('_______________________________')

v=tuple(v)        # список переделываем в кортеж
print(v)
print(type(v))
print('_______________________________')

a, b , с = 9, 8, 7  # можно присвоить а=9 b= 8 c=7
print(a,b,с)
print('_______________________________')

a=b=1               # можно присвоить a=1 and b=1
print(a,b)
print('_______________________________')

a,b,с=v             #так можно распокавать кортеж
print(a,b,с)

print('_______________________________')
print('Словари')
d={}                #так можно создать словарь
d=dict()            #так можно создать словарь
d='qwerty'
print(d)
print('_______________________________')

dictionary={}
dictionary={'up': '↑', 'right':'→', 'left': '←', 'douwn' :'↓'}
print(dictionary['up'])

for item in dictionary:
    print('{}:{}'.format(item, dictionary[item]))
# up:↑
# right:→
# left:←
# douwn:↓
print('_______________________________')

for (k,v) in dictionary.items():
        print(k,v)
# up:↑
# right:→
# left:←
# douwn:↓
print('_______________________________')

print('Множества-почти то же что и словари, но значения уникальные и без ключей')
color={'red', 'green', 'blue'}
print(color)      #{'red', 'green', 'blue'}        
     
color.add('red')
print(color)      #{'red', 'green', 'blue'} не добавиться так как red есть уже!!!

color.add('yello')
print(color)      #{'red', 'yello', 'green', 'blue' }  добавиться yello но куда не известно


color.remove('red')
print(color)

color.discard('red')
print(color)

#Операции с множествами:

a={1, 2, 3,  5,  8 }

b={ 2,  5,  8, 13, 21}
c=a.copy()                         #{1, 2, 3,  5,  8 }
print(c)
u=a.union(b)                       #{1, 2, 3,  5,  8, 13, 21 }
print(b)
i=a.intersection(b)                #{2,  5,  8 }
print(i)
d1=a.difference(b)                 #{1,  3}
print(d1)
d2=b.difference(a)                 #{13, 21 }
print(d2)
q=a.union(b).difference(a.intersection(b)) #{1,  21,  3, 13 }
print(q)
print('_______________________________')

print('ГЕНЕРАТОРЫ СПИСКОВ:')

#Необходимо создать список чисел от 1 до 100:
#Вариант 1 через цикл
list_6=[]
for i in range (1, 101):
    list_6.append(i)
print(list_6)
print('____________________________________________________________________________')
#Вариант 2 через список
list_6=[i for i in range (1, 101)]
print(list_6)
print('____________________________________________________________________________')
#Вариант 3 добавили условие только четные!!
list_6=[i for i in range (1, 101) if i%2==0]
print(list_6)
print('____________________________________________________________________________')
#Вариант 4 добавили к каждому числу еще пару (кортежи)число и его квадрат
list_6={(i, i*i) for i in range (1, 101) if i%2==0}
print(list_6)
print('____________________________________________________________________________')
#Вариант 5 можно умножать/делить и так далее
list_6=[i*2 for i in range (10) if i%2==0]
print(list_6)
print('____________________________________________________________________________')





